Ran Plan for project: `demo` dir: `.infra/terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_role.IAM-role must be replaced
-/+ resource "aws_iam_role" "IAM-role" {
      ~ arn                   = "arn:aws:iam::347383665746:role/K8-ServiceAccount-IAMRole-medplum" -> (known after apply)
      ~ create_date           = "2025-04-24T18:54:31Z" -> (known after apply)
      ~ id                    = "K8-ServiceAccount-IAMRole-medplum" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "K8-ServiceAccount-IAMRole-medplum" -> "K8-ServiceAccount-IAMRole-Medplum" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ unique_id             = "AROAVBYNOCRJFINFWGPKP" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "vault_identifier" but a
│ value was found in file "env/demo.tfvars". If you meant to use this value,
│ add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p demo`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.ffar0wwu.com/lock?id=ThirtyMadison%252Fmedplum%252F.infra%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p demo`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`